In [2]:
# Import dependencies
import pandas as pd
import numpy as np
import os

from datetime import datetime

# Multiple paths
import glob

# SQL Alquemy
from sqlalchemy import create_engine
import psycopg2

#Postgresql
from config import db_password

# Statistics
import matplotlib.pyplot as plt
import statistics

# More
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler,OneHotEncoder, MinMaxScaler
import tensorflow as tf
import hvplot.pandas

import plotly.express as px
from sklearn.decomposition import PCA
from sklearn.cluster import KMeans

# Python warnings
import warnings
warnings.filterwarnings("ignore")

## Database creation and connection

### Reference:
Import multiple csv files into pandas and concatenate into one DataFrame. (2014, January 3). Stack Overflow. https://stackoverflow.com/questions/20906474/import-multiple-csv-files-into-pandas-and-concatenate-into-one-dataframe

This will allow to get all csv and convine them into one dataframe.

It is important to note that the files have to be in the path that is used, so... in order to use this code just modify the path and select the one containing the ".csv" files.

In [4]:
# To unite all data
# Use your own path where the info is
path = r'C:\Users\Hana\Documents\GitHub\Project_B\Final_csvs'

stock_df = pd.concat([pd.read_csv(f'{path}/{f}') for f in os.listdir(path) if f.endswith('.csv')])

In [5]:
stock_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Name
0,02-01-14,25.070000,25.820000,25.059999,25.360001,23.907921,8997900,AAL
1,03-01-14,25.750000,26.750000,25.510000,26.540001,25.020357,13829600,AAL
2,06-01-14,26.620001,27.200001,26.600000,27.030001,25.482302,11271400,AAL
3,07-01-14,27.200001,27.400000,26.670000,26.910000,25.369167,11288700,AAL
4,08-01-14,26.370001,27.680000,26.350000,27.629999,26.047945,15733900,AAL

In [6]:
stock_df.tail()

,Date,Open,High,Low,Close,Adj Close,Volume,Name
427596,23-12-20,36.520000,37.000000,35.810001,36.650002,36.650002,314400,ZUMZ
427597,24-12-20,36.939999,37.139999,35.970001,36.009998,36.009998,94800,ZUMZ
427598,28-12-20,36.230000,37.240002,35.830002,36.709999,36.709999,233800,ZUMZ
427599,29-12-20,36.919998,36.919998,35.849998,36.610001,36.610001,174400,ZUMZ
427600,30-12-20,36.500000,37.299999,36.270000,36.619999,36.619999,145100,ZUMZ